//---------------------------------------------------------------------------
/*
	Risse [りせ]
	 stands for "Risse Is a Sweet Script Engine"
	Copyright (C) 2000-2006 W.Dee <dee@kikyou.info> and contributors

	See details of license at "license.txt"
*/
//---------------------------------------------------------------------------
//! @file
//! @brief オブジェクトの C++ インターフェースの実装
//---------------------------------------------------------------------------
#include "prec.h"

#include "risseCxxObject.h"

RISSE_DEFINE_SOURCE_ID(53018,62403,2623,19559,39811,3052,55606,53445);

namespace Risse
{
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
} // namespace Risse
