//---------------------------------------------------------------------------
/*
	Risa [りさ]      alias 吉里吉里3 [kirikiri-3]
	 stands for "Risa Is a Stagecraft Architecture"
	Copyright (C) 2000-2006 W.Dee <dee@kikyou.info> and contributors

	See details of license at "license.txt"
*/
//---------------------------------------------------------------------------
//! @file
//! @brief アイドル時に発生するイベントを提供するモジュール
//---------------------------------------------------------------------------
#include "prec.h"
#include "base/event/IdleEvent.h"

RISSE_DEFINE_SOURCE_ID(58504,55707,27606,20246,35200,16274,28002,46284);


/*! @note
	アイドルイベントは、アプリケーションで他に処理すべきイベントが無くなった
	場合に発生するイベントである (実際のところこれは嘘で、wxWidgets の Idle
	イベント時に確かに発生するイベントではあるが、Risa のイベントシステムの
	キュー上にイベントが残っていても、一回で処理すべきイベントの処理が終われば
	呼び出される)。
	アイドルイベントの戻り値を真にすると連続してアイドルイベントが発生するように
	なる (吉里吉里２における Continous Event と同等)。

	コンパクトイベントは、アプリケーションのウィンドウが非アクティブになったり
	アプリケーションが非アクティブになったり、あるいは５秒おきに発生するイベン
	ト。なにか未処理の終了処理があればそれを終了させたり、ガベージコレクション
	を実行したりする。
*/


//---------------------------------------------------------------------------
//! @brief		アイドルイベントの配信先を登録する
//! @param		item		配信先
//---------------------------------------------------------------------------
void tRisaIdleEventManager::Register(tRisaIdleEventDestination * item)
{
	Destinations.add(item);
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		アイドルイベントの配信先の登録を解除する
//! @param		item		配信先
//---------------------------------------------------------------------------
void tRisaIdleEventManager::Unregister(tRisaIdleEventDestination * item)
{
	Destinations.remove(item);
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		アイドルイベントを配信する
//! @param		mastertick		このイベントが配信される際の TickCount
//! @return		まだアイドルイベントが必要かどうか
//---------------------------------------------------------------------------
bool tRisaIdleEventManager::Deliver(risse_uint64 mastertick)
{
	bool need_more = false;

	// Idleイベントは tRisaEventSystem がイベントを配信可能かどうかを見る
	if(tRisaEventSystem::alive() && tRisaEventSystem::instance()->GetCanDeliverEvents())
	{
		// イベントを配信する
		pointer_list<tRisaIdleEventDestination>::scoped_lock lock(Destinations);
		for(size_t i = 0; i < Destinations.get_locked_count(); i++)
		{
			if(Destinations.get_locked(i)->OnIdle(mastertick))
				need_more = true;
		}
	}
	return need_more;
}
//---------------------------------------------------------------------------













//---------------------------------------------------------------------------
//! @brief		コンストラクタ
//---------------------------------------------------------------------------
tRisaIdleEventDestination::tRisaIdleEventDestination()
{
	Receiving = false;
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		コンストラクタ
//---------------------------------------------------------------------------
tRisaIdleEventDestination::~tRisaIdleEventDestination()
{
	if(Receiving) tRisaIdleEventManager::instance()->Unregister(this);
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		アイドルイベントの受信を開始する
//---------------------------------------------------------------------------
void tRisaIdleEventDestination::StartReceiveIdle()
{
	if(!Receiving)
	{
		tRisaIdleEventManager::instance()->Register(this);
		Receiving = true;
	}
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		アイドルイベントの受信を停止する
//---------------------------------------------------------------------------
void tRisaIdleEventDestination::EndReceiveIdle()
{
	if(Receiving)
	{
		tRisaIdleEventManager::instance()->Unregister(this);
		Receiving = false;
	}
}
//---------------------------------------------------------------------------
































//---------------------------------------------------------------------------
//! @brief		コンストラクタ
//---------------------------------------------------------------------------
tRisaCompactEventManager::tRisaCompactEventManager()
{
	wxTimer::Start(5000); // 5秒周期のタイマーをスタートする
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		コンパクトイベントの配信先を登録する
//! @param		item		配信先
//---------------------------------------------------------------------------
void tRisaCompactEventManager::Register(tRisaCompactEventDestination * item)
{
	Destinations.add(item);
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		コンパクトイベントの配信先の登録を解除する
//! @param		item		配信先
//---------------------------------------------------------------------------
void tRisaCompactEventManager::Unregister(tRisaCompactEventDestination * item)
{
	Destinations.remove(item);
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		コンパクトイベントを配信する
//! @param		level		レベル
//---------------------------------------------------------------------------
void tRisaCompactEventManager::Deliver(tCompactLevel level)
{
	pointer_list<tRisaCompactEventDestination>::scoped_lock lock(Destinations);
	for(size_t i = 0; i < Destinations.get_locked_count(); i++)
		Destinations.get_locked(i)->OnCompact(level);
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		タイマー周期が来た時
//---------------------------------------------------------------------------
void tRisaCompactEventManager::Notify()
{
	Deliver(clSlowBeat);
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		ウィンドウが非アクティブになった場合
//---------------------------------------------------------------------------
void tRisaCompactEventManager::OnDeactivate()
{
	Deliver(clDeactivate);
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief		アプリケーションが非アクティブになった場合
//---------------------------------------------------------------------------
void tRisaCompactEventManager::OnDeactivateApp()
{
	Deliver(clDeactivateApp);
}
//---------------------------------------------------------------------------






