//---------------------------------------------------------------------------
/*
	Risa [りさ]      alias 吉里吉里3 [kirikiri-3]
	 stands for "Risa Is a Stagecraft Architecture"
	Copyright (C) 2000-2007 W.Dee <dee@kikyou.info> and contributors

	See details of license at "license.txt"

	Rina stands for "Rina is an Imaging Network Assembler"
*/
//---------------------------------------------------------------------------
//! @file
//! @brief RINA ピン管理
//---------------------------------------------------------------------------
#include "visual/rina/rinaGDS.h"

namespace Rina {
//---------------------------------------------------------------------------


class tProcessNode;
//---------------------------------------------------------------------------
//! @brief		ピン
//---------------------------------------------------------------------------
class tPin : public tCollectee
{
	typedef tCollectee inherited;

	tProcessNode * Node; //!< このピンがアタッチされているノード

public:
	//! @brief		コンストラクタ
	tPin();

	//! @brief		プロセスノードにこのピンをアタッチする
	//! @param		node		プロセスノード (NULL=デタッチ)
	void Attatch(tProcessNode * node) { Node = node; }

};
//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
//! @brief		入力ピン
//---------------------------------------------------------------------------
class tInputPin : public tPin
{
	typedef tPin inherited;

public:
	//! @brief		コンストラクタ
	//! @param		node		ノード
	tInputPin();
};
//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
//! @brief		入力ピン
//---------------------------------------------------------------------------
class tOutputPin : public tPin
{
	typedef tPin inherited;

public:
	//! @brief		コンストラクタ
	//! @param		node		ノード
	tOutputPin();
};
//---------------------------------------------------------------------------



//---------------------------------------------------------------------------
}

