//---------------------------------------------------------------------------
/*
	TVP3 ( T Visual Presenter 3 )  A script authoring tool
	Copyright (C) 2000-2005  W.Dee <dee@kikyou.info> and contributors

	See details of license at "license.txt"
*/
//---------------------------------------------------------------------------
//! @file
//! @brief 吉里吉里 レンダリング済みフォント作成ツールアプリケーションメインルーチン
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief アプリケーションクラス
//---------------------------------------------------------------------------
class wxKrkrFontApp:public wxApp
{
public:
	bool OnInit();
	int OnExit();
};
//---------------------------------------------------------------------------

 
