//---------------------------------------------------------------------------
/*
	Risa [りさ]      alias 吉里吉里3 [kirikiri-3]
	 stands for "Risa Is a Stagecraft Architecture"
	Copyright (C) 2000-2006 W.Dee <dee@kikyou.info> and contributors

	See details of license at "license.txt"
*/
//---------------------------------------------------------------------------
//! @file
//! @brief 吉里吉里 レンダリング済みフォント作成ツールアプリケーションメインルーチン
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
//! @brief アプリケーションクラス
//---------------------------------------------------------------------------
class wxKrkrFontApp:public wxApp
{
public:
	bool OnInit();
	int OnExit();
};
//---------------------------------------------------------------------------

 
